Repository: Waksim/MKvoice
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru, uk

source: You already have an active task. Please wait for it to finish.
ru: У вас уже есть активная задача. Пожалуйста, подождите, пока она завершится.
uk: У вас вже є активне завдання. Будь ласка, зачекайте, поки воно завершиться.

source: Too many requests, please try again later (limit: {rate_limit} s).
ru: Слишком много запросов, попробуйте позже (лимит: {rate_limit} с).
uk: Занадто багато запитів, спробуйте пізніше (ліміт: {rate_limit} с).

source: {minutes} min
ru: {minutes} мин
uk: {minutes} хв

source: {seconds} sec
ru: {seconds} сек
uk: {seconds} сек

source: Very easy to read
ru: Очень легко читать
uk: Дуже легко читати

source: Easy to read
ru: Легко читать
uk: Легко читати

source: Moderately difficult
ru: Умеренно сложно
uk: Помірно складно

source: Hard to read
ru: Трудно читать
uk: Важко читати

source: Very hard to read
ru: Очень трудно читать
uk: Дуже важко читати

source: 📝 Your text contains {word_count} words and {char_count} characters. ⏳ Approximate narration time: {estimated_time_str}. 📊 <b>Text Analysis</b>: - <b>Top-5 words</b>: {top_words} - <b>Reading level</b>: {reading_level} (Flesch: {reading_ease:.2f}) - <b>Suggested education level</b>: {grade_level} - <b>Key phrases</b>: {key_phrases}
ru: 📝 Ваш текст содержит {word_count} слов и {char_count} символов. ⏳ Примерное время озвучивания: {estimated_time_str}. 📊 <b>Анализ текста</b>: - <b>Топ-5 слов</b>: {top_words} - <b>Уровень чтения</b>: {reading_level} (Flesch: {reading_ease:.2f}) - <b>Рекомендуемый уровень образования</b>: {grade_level} - <b>Ключевые фразы</b>: {key_phrases}
uk: 📝 Ваш текст містить {word_count} слів і {char_count} символів. ⏳ Приблизний час озвучування: {estimated_time_str}. 📊 <b>Аналіз тексту</b>: - <b>Топ-5 слів</b>: {top_words} - <b>Рівень читання</b>: {reading_level} (Flesch: {reading_ease:.2f}) - <b>Рекомендований рівень освіти</b>: {grade_level} - <b>Ключові фрази</b>: {key_phrases}

source: Empty text for synthesis.
ru: Пустой текст для озвучивания.
uk: Порожній текст для озвучення.

source: Could not synthesize: empty text.
ru: Невозможно озвучить: текст пуст.
uk: Неможливо озвучити: текст порожній.

source: @{username}, length - {len_text}: {preview}...
ru: @{username}, длина - {len_text}: {preview}...
uk: @{username}, довжина - {len_text}: {preview}...

source: Could not detect language. Using default voice.
ru: Не удалось определить язык. Используется голос по умолчанию.
uk: Неможливо визначити мову. Використовується голос за замовчуванням.

source: Detected language: {lang}. Using voice: {voice}
ru: Определён язык: {lang}. Используется голос: {voice}
uk: Виявлено мову: {lang}. Використовується голос: {voice}

source: Part {i}/{total_parts} synthesized in {seconds} sec.
ru: Часть {i}/{total_parts} озвучена за {seconds} сек.
uk: Частина {i}/{total_parts} озвучена за {seconds} сек.

source: 👋 Hi! I can help you convert text to speech in various ways. 🔹 <b>What I can do:</b> - Send me a text message to synthesize speech. - Send a link to a website to extract text and synthesize it. - Send a file (<code>.docx</code>, <code>.fb2</code>, <code>.epub</code>) to extract text and synthesize it. - Add me to a group chat and use the command <b>/vv help</b> to see how to work with me in groups. 📄 <b>Available commands:</b> <b>/help</b> - Show help <b>/change_lang</b> - Change interface language ❓ <b>Questions or suggestions?</b> Contact the bot administrator @maksenro. [ <a href="https://www.donationalerts.com/r/mkprod">Support</a> | <a href="https://t.me/MKprodaction">Group</a> ]
ru: 👋 Привет! Я могу помочь тебе превратить текст в речь различными способами. 🔹 <b>Что я умею:</b> - Отправь мне текст, и я озвучу его. - Отправь ссылку на сайт, я извлеку оттуда текст и озвучу. - Отправь файл (<code>.docx</code>, <code>.fb2</code>, <code>.epub</code>), и я извлеку текст для озвучки. - Добавь меня в групповой чат и используй команду <b>/vv help</b>, чтобы узнать, как со мной работать. 📄 <b>Доступные команды:</b> <b>/help</b> - Показать помощь <b>/change_lang</b> - Изменить язык интерфейса ❓ <b>Вопросы или предложения?</b> Обратись к администратору бота @maksenro. [ <a href="https://www.donationalerts.com/r/mkprod">Поддержка</a> | <a href="https://t.me/MKprodaction">Группа</a> ]
uk: 👋 Привіт! Я допоможу перетворити текст на мовлення різними способами. 🔹 <b>Мої можливості:</b> - Надішліть мені текст, і я його озвучу. - Надішліть посилання на сайт — витягну текст і озвучу. - Надішліть файл (<code>.docx</code>, <code>.fb2</code>, <code>.epub</code>) — я дістану текст і озвучу. - Додайте мене в груповий чат і скористайтеся командою <b>/vv help</b>, щоб дізнатися, як зі мною працювати. 📄 <b>Доступні команди:</b> <b>/help</b> - Показати допомогу <b>/change_lang</b> - Змінити мову інтерфейсу ❓ <b>Запитання чи пропозиції?</b> Звертайтеся до адміністратора бота @maksenro. [ <a href="https://www.donationalerts.com/r/mkprod">Підтримати</a> | <a href="https://t.me/MKprodaction">Група</a> ]

source: Set chunk size
ru: Установить размер куска
uk: Налаштувати розмір фрагменту

source: Set TTS speed
ru: Установить скорость TTS
uk: Налаштувати швидкість TTS

source: Choose a setting to update:
ru: Выберите настройку для изменения:
uk: Оберіть параметр для зміни:

source: Please enter the chunk size (5,000 - 80,000):
ru: Введите размер куска (от 5,000 до 80,000):
uk: Введіть розмір фрагменту (5 000 - 80 000):

source: Chunk size updated to: {size}
ru: Размер куска обновлён: {size}
uk: Розмір фрагменту оновлено: {size}

source: Value out of range (5,000–80,000). Please try again.
ru: Значение вне диапазона (5,000–80,000). Попробуйте снова.
uk: Значення поза межами (5 000–80 000). Спробуйте ще раз.

source: Invalid number. Please try again.
ru: Некорректное число. Попробуйте ещё раз.
uk: Неправильне число. Спробуйте знову.

source: Choose desired TTS speed:
ru: Выберите желаемую скорость TTS:
uk: Оберіть бажану швидкість TTS:

source: Speed updated to: {spd}
ru: Скорость обновлена: {spd}
uk: Швидкість змінено на: {spd}

source: Please choose your language:
ru: Пожалуйста, выберите язык:
uk: Будь ласка, оберіть мову:

source: Unsupported language.
ru: Неподдерживаемый язык.
uk: Непідтримувана мова.

source: Language updated!
ru: Язык обновлён!
uk: Мову оновлено!

source: 📖 <b>Available commands:</b> /start - Begin interaction with the bot /help - Show this message /change_lang - Change interface language 🤖 <b>Bot capabilities:</b> - Send text messages, and the bot will synthesize them using text-to-speech. - Send documents in <code>.docx</code>, <code>.fb2</code>, <code>.epub</code> formats, and the bot will extract and synthesize them. - Send links to web pages, and the bot will extract and synthesize the text. 📂 <b>Supported formats:</b> - Text messages: any text - Documents: <code>.docx</code>, <code>.fb2</code>, <code>.epub</code> - Links: HTTP/HTTPS ⚙️ <b>Settings:</b> - Use <b>/change_lang</b> command to change the interface language. - The bot supports multiple languages: English, Russian, Ukrainian, Chinese. 👥 <b>Use in groups:</b> - Add the bot to a group. - Grant it the following permissions: • Read messages • Send messages • Manage messages - <b>Available commands in groups:</b> • /vv &lt;text&gt; - Synthesize the provided text. • /vv &lt;link&gt; - Extract text from the link and synthesize it. • /vv (in reply to a message) - Synthesize text from the replied-to message. ❓ <b>Questions or suggestions?</b> Contact the bot administrator @maksenro. [ <a href="https://www.donationalerts.com/r/mkprod">Support</a> | <a href="https://t.me/MKprodaction">Group</a> ]
ru: 📖 <b>Доступные команды:</b> /start - Начать работу с ботом /help - Показать это сообщение /change_lang - Изменить язык интерфейса 🤖 <b>Возможности бота:</b> - Отправляйте текст, и бот озвучит его. - Отправляйте документы (<code>.docx</code>, <code>.fb2</code>, <code>.epub</code>) — бот извлечёт текст и озвучит. - Отправляйте ссылки на веб-страницы — бот извлечёт текст и озвучит. 📂 <b>Поддерживаемые форматы:</b> - Текстовые сообщения: любой текст - Документы: <code>.docx</code>, <code>.fb2</code>, <code>.epub</code> - Ссылки: HTTP/HTTPS ⚙️ <b>Настройки:</b> - Используйте /change_lang, чтобы сменить язык. - Бот поддерживает английский, русский, украинский, китайский. 👥 <b>Использование в группах:</b> - Добавьте бота в группу. - Предоставьте ему разрешения: • Читать сообщения • Отправлять сообщения • Управлять сообщениями - <b>Команды в группах:</b> • /vv &lt;текст&gt; - Озвучить текст. • /vv &lt;link&gt; - Извлечь текст и озвучить. • /vv (ответ на сообщение) - Озвучить сообщение, на которое ответили. ❓ <b>Вопросы или предложения?</b> Обратитесь к администратору @maksenro. [ <a href="https://www.donationalerts.com/r/mkprod">Поддержка</a> | <a href="https://t.me/MKprodaction">Группа</a> ]
uk: 📖 <b>Доступні команди:</b> /start - Почати роботу з ботом /help - Показати це повідомлення /change_lang - Змінити мову 🤖 <b>Можливості бота:</b> - Надішліть текст для синтезу. - Надішліть <code>.docx</code>, <code>.fb2</code>, <code>.epub</code> — бот отримає текст і озвучить. - Надішліть посилання на веб-сторінку — бот витягне й озвучить текст. 📂 <b>Підтримувані формати:</b> - Текстові повідомлення - Документи: <code>.docx</code>, <code>.fb2</code>, <code>.epub</code> - Посилання: HTTP/HTTPS ⚙️ <b>Налаштування:</b> - Використовуйте /change_lang, щоб змінити мову. - Бот підтримує англійську, російську, українську, китайську. 👥 <b>Використання в групах:</b> - Додайте бота до групи. - Дозвольте йому: • Читати повідомлення • Надсилати повідомлення • Керувати повідомленнями - <b>Команди у групах:</b> • /vv &lt;text&gt; - Озвучити текст. • /vv &lt;link&gt; - Витягти текст за посиланням і озвучити. • /vv (у відповідь) - Озвучити текст з повідомлення. ❓ <b>Питання або пропозиції?</b> Зверніться до адміністратора @maksenro. [ <a href="https://www.donationalerts.com/r/mkprod">Підтримати</a> | <a href="https://t.me/MKprodaction">Група</a> ]

source: Access denied.
ru: Доступ запрещён.
uk: Доступ заборонено.

source: Log file does not exist.
ru: Файл журнала не существует.
uk: Файл журналу не існує.

source: No log messages.
ru: Нет сообщений журнала.
uk: Немає записів у журналі.

source: 📝 Last log lines:
ru: 📝 Последние строки журнала:
uk: 📝 Останні рядки журналу:

source: Failed to read log file: {error}
ru: Ошибка чтения журнала: {error}
uk: Помилка читання журналу: {error}

source: File is too large (max 20 MB).
ru: Файл слишком большой (максимум 20 МБ).
uk: Файл занадто великий (максимум 20 МБ).

source: Could not extract text from the document.
ru: Не удалось извлечь текст из документа.
uk: Не вдалося витягти текст із документа.

source: 📖 <b>Help for /vv command:</b> 🔹 <b>/vv &lt;text&gt;</b> - Synthesize the provided text. 🔹 <b>/vv &lt;link&gt;</b> - Extract text from the link and synthesize it. 🔹 <b>/vv</b> (in reply to a message) - Synthesize text from the replied-to message. 🔹 <b>/vv help</b> or <b>/vv h</b> - Shows this help. 📂 <b>Supported formats:</b> - Text: any text - Links: HTTP/HTTPS ⚙️ <b>Settings:</b> - The bot supports multiple languages: English, Russian, Ukrainian, Chinese. ❓ <b>Questions or suggestions?</b> Contact the bot administrator @maksenro. [ @MKttsBOT | <a href="https://www.donationalerts.com/r/mkprod">Support</a> | <a href="https://t.me/MKprodaction">Group</a> ]
ru: 📖 <b>Справка по команде /vv:</b> 🔹 <b>/vv &lt;текст&gt;</b> - Озвучить указанный текст. 🔹 <b>/vv &lt;link&gt;</b> - Извлечь текст по ссылке и озвучить. 🔹 <b>/vv</b> (в ответ на сообщение) - Озвучить текст из сообщения, на которое ответили. 🔹 <b>/vv help</b> или <b>/vv h</b> - Показать эту справку. 📂 <b>Поддерживаемые форматы:</b> - Текст: любой - Ссылки: HTTP/HTTPS ⚙️ <b>Настройки:</b> - Бот поддерживает несколько языков: английский, русский, украинский, китайский. ❓ <b>Вопросы или предложения?</b> Свяжитесь с администратором @maksenro. [ @MKttsBOT | <a href="https://www.donationalerts.com/r/mkprod">Поддержка</a> | <a href="https://t.me/MKprodaction">Группа</a> ]
uk: 📖 <b>Довідка по команді /vv:</b> 🔹 <b>/vv &lt;text&gt;</b> - Озвучити вказаний текст. 🔹 <b>/vv &lt;link&gt;</b> - Витягти текст за посиланням і озвучити. 🔹 <b>/vv</b> (у відповідь на повідомлення) - Озвучити текст із повідомлення. 🔹 <b>/vv help</b> або <b>/vv h</b> - Показати цю довідку. 📂 <b>Підтримувані формати:</b> - Текст: будь-який - Посилання: HTTP/HTTPS ⚙️ <b>Налаштування:</b> - Бот підтримує англійську, російську, українську, китайську. ❓ <b>Запитання чи пропозиції?</b> Зверніться до адміністратора @maksenro. [ @MKttsBOT | <a href="https://www.donationalerts.com/r/mkprod">Підтримати</a> | <a href="https://t.me/MKprodaction">Група</a> ]

source: No text to synthesize.
ru: Нет текста для озвучивания.
uk: Немає тексту для озвучування.

source: Please provide text after /vv or reply to a message.
ru: Укажите текст после /vv или ответьте на сообщение.
uk: Будь ласка, вкажіть текст після /vv або дайте відповідь на повідомлення.
